syn_generic
syn_map
syn_opt
write_hdl > outputs/picorv32_mapped.v
write_sdc > outputs/picorv32.sdc
report_timing > reports/gui/picorv32.gui.after_opt_timing.rpt
report_gates > reports/gui/picorv32.gui.after_opt_gates.rpt